Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/problems_in_marriages_and_other_relationships/redress_scheme_for_cohabiting_couples.html.txt.tmx
Source language: en
Languages: ga

source: Redress scheme for cohabiting couples
ga: Scéim chúitimh do lánúineacha cómhchónaitheacha

source: Under the Civil Partnership and Certain Rights and Obligations of Cohabitants Act 2010 a redress scheme has been introduced for opposite-sex cohabiting couples who are not married and same-sex cohabiting couples who are not registered in a civil partnership
ga: Faoin Acht um Pháirtnéireacht Shibhialta agus Cearta agus Oibleagáidí ar Leith do Chomhchónaitheoirí 2010 tá scéim chúitimh bunaithe do lanúineacha ar ghnéis dhifriúla iad atá ag comhchónaí agus nach bhfuil pósta agus nach bhfuil cláraithe i bpáirtnéireacht shibhialta

source: The redress scheme provides for a broadly similar range of orders as are available to married couples when they separate or divorce
ga: Soláthraíonn an scéim chúitimh do réimse orduithe cosúil go leathan mar atá ar fáil do lanúineacha pósta nuair a scarann nó a cholscarann siad

source: The aim is to provide protection for a financially dependent member of the couple if a long-term cohabiting relationship ends either through death or separation
ga: Is í an aidhm ná cosaint a sholáthar do bhall cleithiúnach ó thaobh airgeadais de den lánúin má chuirtear críoch le caidreamh fadtéarmach comhchónaitheach trí bhás nó trí scaradh

source: The Act came into effect on 1 January 2011
ga: Tháinig an tAcht in éifeacht ar 1 Eanair 2011

source: Cohabitants are defined in the Act as two same-sex or opposite-sex adults who are:
ga: Sainmhínítear comhchónaitheoirí san Acht mar dhá aosach ar chomhghnéis nó ar ghnéis dhifriúla iad:

source: • Not married to each other and not in a registered civil partnership
ga: • Nach bhfuil pósta lena chéile agus nach bhfuil i bpáirtnéireacht shibhialta chláraithe

source: • Not related within the prohibited degrees of relationship (broadly speaking, relationships which would make them ineligible to marry each other)
ga: • Nach bhfuil gaol eatarthu laistigh de na céimeanna cosctha caidrimh (ar bhealach leathan, caidrimh a neamhcháileodh iad chun a chéile a phósadh)

source: • Living together in an intimate and committed relationship
ga: • Atá ina gcónaí lena chéile i gcaidreamh dlúth agus tiomanta

source: A financially dependent cohabitant may be able to apply to the courts for redress if the relationship ends as the result of death or otherwise
ga: D’fhéadfaí go mbeadh comhchónaitheoir cleithiúnach ó thaobh airgeadais de in ann cur isteach chuig na cúirteanna ar chúiteamh má chuirtear críoch leis an gcaidreamh trí bhás nó eile

source: In order to apply for redress you must be a qualified cohabitant, that is, you must have been:
ga: Chun cur isteach ar chúiteamh, caithfidh tú a bheith i do chomhchónaitheoir cáilithe, is é sin, caithfidh go raibh tú:

source: • A cohabitant for at least 5 years or
ga: • I do chomhchónaitheoir ar feadh 5 bliana ar a laghad nó

source: • A cohabitant for 2 years if you have had a child with your partner
ga: • I do chomhchónaitheoir ar feadh 2 bhliain má bhí leanbh agat le do pháirtnéir

source: However, if one of you is still married, then neither of you may be a qualified cohabitant until the married person has been living apart from his/her spouse for at least 4 of the previous 5 years – in effect, until he or she is entitled to seek a divorce
ga: Má tá duine agaibh pósta fós, áfach, d’fhéadfaí nach bhfuil ceachtar agaibh in bhur gcomhchónaitheoirí cáilithe go dtí go bhfuil an duine pósta ina chónaí óna chéile óna c(h)éile do ar a laghad 4 bliana de na 5 bliana roimhe sin – in éifeacht, go dtí go bhfuil sé nó sí i dteideal colscaradh a lorg

source: The redress arrangements applies only to those qualified cohabitants whose relationship ends after the Act commenced on 1 January 2011, but the time spent cohabiting before that may be taken into account
ga: Baineann na socruithe cúitimh leis na comhchónaitheoirí cáilithe sin a gcríochnaíonn a gcaidreamh tar éis thús an Achta ar 1 Eanair 2011, ach d’fhéadfaí go gcuirfí an t-am caite ag comhchónaí lena chéile san áireamh

source: If you are a qualified cohabitant, you may apply for orders such as maintenance orders, property adjustment orders, and pension adjustment orders and related orders such as attachment of earnings orders
ga: Más comhchónaitheoir cáilithe tú, féadfaidh tú cur isteach ar orduithe ar nós orduithe cothabhála, orduithe coigeartaithe réadmhaoine agus orduithe coigeartaithe pinsin agus orduithe gaolmhara ar nós orduithe um astú tuillimh

source: You may also apply for provision to be made from the estate of a deceased cohabitant
ga: Féadfaidh tú cur isteach chomh maith go ndéanfaí soláthar ó eastát chomhchónaitheoir básaithe

source: You do not have any automatic right to get such orders
ga: Níl aon cheart as féin agat na horduithe sin a fháil

source: The court may make such orders if it is satisfied that you were financially dependent on your cohabitant partner
ga: Féadfaidh an chúirt a leithéid d’orduithe a dhéanamh má tá sí sásta go raibh tú cleithiúnach ó thaobh airgeadais de ar do pháirtnéir comhchónaithe

source: In making a decision, the courts must take into account a number of factors including
ga: I gcinneadh a dhéananmh, caithfidh na cúirteanna roinnt fachtóirí a chur san áireamh, ina n-áirítear

source: • The financial circumstances, needs and obligations of each cohabitant
ga: • Na cúinsí, riachtanais agus oibleagáidí airgeadais atá ag gach comhchónaitheoir

source: • The rights of others (including the rights of spouses, former spouses, civil partners, former civil partners and dependent children of either partner)
ga: • Cearta daoine eile (ina n-áirítear cearta céilí, iarchéilí, páirtnéirí sibhialta, iar-phairtnéirí sibhialta agus leanaí cleithiúnacha de cheachtar páirtnéir)

source: • The duration and nature of the relationship
ga: • Fad agus nádúr an chaidrimh

source: • The contribution made by each, financial and otherwise
ga: • An méid ar chuir gach páirtnéir leis, go hairgeadúil agus eile

source: Such orders may not affect the rights of spouses or former spouses
ga: D’fhéadfaí nach gcuirfeadh a leithéid d’orduithe isteach ar chearta céilí ná iarchéilí

source: They may affect the rights of civil partners or former civil partners
ga: D’fhéadfaí go gcuirfidís isteach ar chearta pháirtnéirí sibhialta nó iar-pháirtnéirí sibhialta

source: In general you must apply for such orders within 2 years of the end of the relationship but an application for provision from the estate of the deceased partner must be made within 6 months of an application for a grant of probate. In general, such orders will lapse and will no longer be available if you marry. Redress orders and tax
ga: Go ginearálta, caithfidh tú cur isteach ar a leithéid d’orduithe laistigh de 2 bhliain ó chríoch an chaidrimh ach caithfear iarratas ar sholáthar ó eastát ó pháirtnéir básaithe a bheith déanta laistigh de 6 mhí d’iarratas ar dheonú promháide

source: The amount of the maintenance payment is allowed as a deduction from the income of your former cohabitant
ga: Go ginearálta, rachaidh a leithéid d’orduithe i léig agus ní bheidh siad ar fáil a thuilleadh má phósann tú

source: Agreements on financial matters between cohabitant partners may be regarded as valid only if:
ga: Féachfar ar chomhaontaithe ar chúrsaí airgeadais idir pháirtnéirí comhchónaithe a bheith bailí má:

source: • Each of you has had independent legal advice or you have received legal advice together and have waived the right to independent legal advice
ga: • Tá comhairle dlí neamhspleách faighte ag an mbeirt agaibh nó ná comhairle dlí faighte agaibh lena chéile agus tharscaoil sibh an ceart chuig comhairle dlí neamhspleách

source: • The agreement constitutes a contract
ga: • Is éard atá sa chomhaontú ná conradh

source: • The agreement has been signed by each of you
ga: • Tá an conradh sínithe ag an mbeirt agaibh

source: Such an agreement may include a provision that the redress scheme does not apply to them
ga: D’fhéadfaí go bhfuil foráil nach mbaineann an scéim chúitimh leo san áireamh sa chomhaontú

source: This is different from similar agreements by married couples
ga: Tá sé seo difriúil ó chomhaontaithe cosúla ag lánúineacha pósta

source: Agreements between a married couple may not validly exclude either party’s right to apply to the courts for various orders (for example, a maintenance order)
ga: Ní féidir le comhaontaithe idir lánúineacha pósta ceart ceachtar páirtí a eisiamh chun cur isteach chuig na cúirteanna d’orduithe ar leith (mar shampla, ordú cothabhála)

source: A court may set aside or vary a cohabitants’ agreement in exceptional circumstances if its enforcement would cause serious injustice
ga: D’fhéadfaí go gcuirfeadh cúirt comhaontú comhchónaitheora ar leataobh nó é a éagsúlú in gcúinsí eisceachtúla dá dtarraingeodh a fhorfheidhmithe troméagóir

source: Agreements entered into by cohabitants before the Act commenced are enforceable
ga: Tá comhaontaithe a ndeachaigh na comhchónaitheoirí isteach iontu roimh thús an Achta forfheidhmithe

source: If you are in a situation where you are concerned about your rights following the breakdown of your cohabiting relationship, you should seek legal advice
ga: Má tá tú i gcás ina bhfuil imní ort faoi do chearta tar éis cliseadh do chaidreamh comhchónaithe, ba cheart duit comhairle dlí a lorg

source: Solicitors' fees in Ireland are not fixed and can vary considerably
ga: Níl táillí abhcóide seasta in Éirinn agus is féidir leo a bheith an-éagsúl

source: Shop around and obtain some quotes before you decide on a particular legal firm
ga: Déan géarsiopadóireacht agus faigh roinnt praghasanna sula ndéanfaidh tú cinneadh ar ghnóthlacht dlíthiúil áirithe

source: Contact information for solicitors firms throughout Ireland is available on the Law Society website
ga: Tá eolas teagmhála d’abhcóidí ar fud na hÉireann ar fáil ar shuíomh gréasáin Dlí-Chumann na hÉireann

source: If you are eligible for legal aid and advice from the Legal Aid Board, you must pay a contribution towards costs
ga: Má tá tú incháilithe do chúnamh agus do chomhairle dlí ón mBord um Chúnamh Dlí caithfidh tú ranníocaíocht a dhéanamh ar chostais

source: Contact your nearest law centre for information on Legal Aid
ga: Téigh i dteagmháil leis an ionad dlí is gaire duit d’eolas ar Chúnamh Dlí

source: FLAC (Free Legal Advice Centres) is an independent, voluntary organisation that operates a network of legal advice clinics throughout the country
ga: Is eagraíocht neamhspleách, dheonach í ISD (Ionaid Saorchomhairle Dlí) a oibríonn líonra clinicí comhairle dlí ar fud na tíre

source: These clinics are confidential, free of charge and open to all
ga: Tá na clinicí seo faoi rún, saor in aisce agus oscailte do chách

source: Contact your nearest Citizens Information Centre for information on FLAC services in your area
ga: Téigh i dteagmháil leis an Ionad Eolais do Shaoránaigh is gaire duit d’eolas ar sheirbhísí ISD i do cheantar

source: FLAC also runs an information and referral line during office hours for basic legal information
ga: Ritheann ISD líne eolais agus atreoraithe i rith uaireanta oifige d’eolas dlí bunúsach
